#include "wtpch.h"
#include "EditorLayerBase.h"

namespace Wheatear {


    // =========================================================================
    // 鏋勯€?    // =========================================================================

    EditorLayerBase::EditorLayerBase(const std::string& debugName)
        : Layer(debugName)
    {
    }

    // =========================================================================
    // Layer 鐢熷懡鍛ㄦ湡
    // =========================================================================

} // namespace Wheatear
